Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/children_s_rights_and_policy/national_children_s_strategy.html.txt.tmx
Source language: en
Languages: ga

source: National policy on children and young people
ga: An Straitéis Náisiúnta Leanaí

source: The Department of Children and Youth Affairs was established in 2011 and brings together a number of key areas of policy and provision for children, young people and families
ga: Ba phlean deich mbliana é an Stráitéis Náisiúnta do Pháistí a d’fhoilsigh an Rialtas sa bhliain 2000. Ba é an treoirphlean é chun saolta páistí a fheabhsú. Bhí trí phríomhsprioc aige:

source: It focuses on policy issues that affect children in areas such as early childhood care and education, youth justice, child welfare and protection, children and young people's participation, research on children and young people and youth work
ga: • Bheadh guth ag leanaí i gcúinsí a bhfuil tionchar acu orthu agus bheadh a gcuid tuairimí tógtha san áireamh i gcomhréir lena n-aois agus a n-aibíocht. • Bheadh tuiscint níos fearr ar shaolta leanaí; bheadh leas ann dár saolta ó luacháil, ó thaighde agus ó eolas ar a ndíotha, a gcearta agus éifeachtach seirbhísí

source: It has developed a national policy framework for children and young people
ga: Foilsíodh tuarascálacha ar dhul chun cinn ar chur i bhfeidhm na straitéise do 2002, 2003 agus 2004

source: A national strategy on participation in decision-making and a youth strategy were developed to develop on specific parts of the national policy framework
ga: Sa bhliain 2005 cuireadh an Oifig Náisiúnta do Leanaí isteach mar chuid d’Oifig an Aire Leanaí agus Gnóthaí Óige

source: In April 2014 the Department of Children and Youth Affairs published Better Outcomes, Brighter Futures: the National Policy Framework for Children and Young People 2014–2020 (pdf). It is the first national policy framework for children and young people aged from birth to 24 years
ga: Bunaíodh Oifig an Aire Leanaí agus Gnóthaí Óige (OMYCA) i mí na Nollag 2005 chun comhleanúnachas níos fearr a thabhairt do dhearadh beartais do leanaí agus bhí ról tábhachtach aige i dtacú le cur i bhfeidhm na Straitéise Náisiúnta do Leanaí

source: It establishes a shared set of outcomes for children and young people towards which all government departments, agencies, statutory services and the voluntary and community sectors work
ga: Bhí sé mar chuid den Roinn Sláinte ach bhí aonaid ón Roinn Dlí agus Cirt agus Comhionannais agus an Roinn Oideachais agus Scileanna suite in éineacht leis

source: These outcomes are to:
ga: Seo a leanas na haonaid a bhí taobh istigh den OMCYA:

source: • Be active and healthy, with positive physical and mental wellbeing
ga: • Aonad Beartais Leasa Leanaí agus Cosanta

source: • Achieve their full potential in all areas of learning and development
ga: • Stiúrthóireacht Cúraim Leanaí (a bhí mar chuid den Roinn Dlí agus Cirt agus Comhionannais cheana)

source: • Be safe and protected from harm
ga: • Aonad Náisiúnta um Stráitéis Leanaí agus Daoine Óige (ar a dtugadh an Oifig Náisiúnta do Leanaí)

source: • Have economic security and opportunity
ga: • Seirbhís Ceartas Óige na hÉireann (cuid den Roinn Dlí agus Cirt agus Comhionannais)

source: • Be connected, respected and contributing to their world
ga: • Aonad Beartas um Oideachas sna Luathbhlianta (cuid den Roinn Oideachais agus Scileanna)

source: It provides the framework for the development and implementation of policy and services for children and young people
ga: I Meitheamh 2011, bunaíodh an Roinn Leanaí agus Gnóthaí Óige, agus rinneadh aire iomláin den Aire Leanaí agus Gnóthaí Óige

source: National Strategy for Research and Data on Children’s Lives
ga: Grúpa um Fheidhmiú na Straitéise Náisiúnta do Leanaí

source: The National Strategy for Research and Data on Children’s Lives 2011–2016 (pdf) recognises that good information is essential in helping us understand both how children and young people are developing and how policies and services impact on their lives
ga: Bhí eochairthosaíocht an NCSIG a chinntiú go gcuirtear na pleananna straitéiseacha agus na cáipéisí beartais uile i bhfeidhm a bhí tar éis deartha agus foilsithe cheana maidir le seirbhísí leanaí in Éirinn

source: The strategy sets out a plan for research and data on children’s lives in Ireland over the period 2011–2016 and after that
ga: Mar chuid den phróiseas chun a spriocanna a bhaint amach, bhí an NCSIG tiomanta do líonra a bhunú de Choiste Seirbhísí do Leanaí agus Daoine Óga

source: National Strategy on Children and Young People's Participation in Decision-making
ga: Coistí Seirbhísí do Leanaí agus Daoine Óga

source: In June 2015 the National Strategy on Children and Young People's Participation in Decision-making (2015–2020) was launched
ga: Cinnteoidh siad go n-oibríonn daoine gairmiúla agus gníomhaireachtaí le chéile ionas go bhfaigheann páistí agus teaghlaigh seirbhísí atá níos fearr agus níos doirsí

source: It identifies the following objectives and priority areas for action:
ga: Tá tuilleadh eolais ar an láithreán gréasáin CYPSC

source: • Children and young people will have a voice in decisions made in their local communities
ga: D’fhoilsigh Oifig an Aire Leanaí agus Gnóthaí Óige an Clár do Sheirbhísí Leanaí (pdf) sa bhliain 2007

source: • Children and young people will have a voice in decision-making in early education, schools and the wider formal and non-formal education systems
ga: Leagann sé amach an treoir straitéiseach agus eochairspriocanna de bheartas poiblí maidir le sláinte leanaí agus seirbhísí sóisialta in Éirinn

source: • Children and young people will have a voice in decisions that affect their health and well-being, including on the health and social services delivered to them
ga: Tarraingíonn sé na cineálacha críocha éagsúla le chéile a bhfaightear i mbeartas leanaí comhaoise agus cuireann sé i láthair iad mar liosta aonair de na 7 Críoch Náisiúnta Seirbhíse do Leanaí in Éirinn. Seo a leanas iad:

source: • Children and young people will have a voice in the Courts and legal system
ga: • Sláinte, go fisiciúil agus go hintinneach

source: • Promoting effective leadership to champion and promote participation of children and young people
ga: • Tacaithe i bhfoghlaim ghníomhach • Slán ó dhochar trí thimpiste agus d’aon ghnó

source: • Development of education and training for professionals working with and on behalf of children and young people
ga: • Daingean go heacnamaíoch • Daingean sa thimpeallacht fisiciúil láithreach agus níos leithne

source: • Mainstreaming the participation of children and young people in the development of policy, legislation and research
ga: • Cuid de líonraí dearfacha teaghlaigh, cairde, comharsana agus an phobail • Mar chuid de agus ag glacadh páirte sa tsochaí

source: National Youth Strategy 2015–2020
ga: Tionscnamh ‘Ag Obair do Pháistí’

source: In October 2015 the Department of Children and Youth Affairs published the National Youth Strategy 2015–2020 (pdf) which builds on the National Policy Framework – Better Outcomes, Brighter Futures
ga: Tá an Aire Leanaí agus Gnóthaí Óige, an Grúpa um Fheidhmiú na Straitéise Náisiúnta do Leanaí agus na Coistí Seirbhísí do Leanaí tar éis a bheith ag obair ar thionscnamh chun forbairt a dhéanamh ar chuspóir pleanála d’idireagraíocht náisiúnta agus áitiúil chun toradh a fheabhsú do pháistí. Tugtar an tionscnamh Ag Obair le Chéile do Leanaí (pdf) air seo trí chéile

source: It sets out the Government’s aim and objectives for young people, aged 10 to 24 years, so that they can achieve the outcomes set out in the policy framework
ga: Tá sé mar aidhm ag an tionscnamh críocha forbartha níos fearr a chinntiú go leanaí trí chomhtháthú níos éifeachtaí de bheartais agus de sheirbhísí

source: Children and Young People’s Services Committees
ga: • Sábháilte agus a chosaint ó dhochar

source: All major organisations and agencies working locally on behalf of children and young people are represented on Children and Young People’s Services Committees (CYPSC)
ga: Soláthraíonn sé an creat d'fhorbairt agus cur i bhfeidhm beartais agus seirbhísí do leanaí agus do dhaoine óga

source: The CYPSCs are responsible for improving the lives of children and families at local and community level, through integrated planning, working and service delivery
ga: Stráitéis Náisiúnta ar Rannpháirtíocht Leanaí agus Daoine Óga i gCinntí a Dhéanamh

source: They ensure that professionals and agencies work together so that children and families receive services that are better and more accessible
ga: I Meitheamh 2015, láinseáladh an Straitéis Náisiúnta ar Rannpháirtíocht Leanaí agus Daoine Óga i gCinntí a dhéanamh

source: There is more information on the CYPSC website
ga: Straitéis Náisiúnta Óige 2015-2020
